hms-homelab/hms-esp-apc/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
CONFIG_UPS_POLL_INTERVAL_MS=5000
CONFIG_MQTT_PUBLISH_INTERVAL_MS=60000
# Browsers send far more than the 512-byte default in request headers, which
# made POST /save fail with 431 "header too long" from the web UI.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
